app/Controllers/Auth.php

SELECT COUNT(*) AS `numrows`
FROM `employes`
---
    private function ensureDemoDataSeeded(): void
    {
        if ((defined('ENVIRONMENT') ? ENVIRONMENT : null) !== 'development') {
            return;
        }

        try {
            $db = db_connect();
            if (!$db->tableExists('employes')) {
                return;
            }

            $count = (int) $db->table('employes')->countAllResults();

SELECT *
FROM `employes`
WHERE `email` = 'employe@techmada.mg'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $model = new EmployeModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
<<<<<<< HEAD
=======

        $this->ensureDemoDataSeeded();
>>>>>>> 5e94279

        $user = $model->where('email', $email)->first();