app/Controllers/Auth.php

    public function login()
    {
        $session = session();
        $model = new EmployeModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'employe@techmada.mg'
 LIMIT 1