app/Controllers/EmployeController.php

SELECT *
FROM `conges`
WHERE `employe_id` IS NULL
SELECT *
FROM `soldes`
WHERE `employe_id` IS NULL
---
    public function index()
    {
        $userId = session()->get('user_id');
        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();

        $data = [
            'titre'  => 'Mon Espace',
            'mes_conges' => $congeModel->where('employe_id', $userId)->findAll(),
            'mes_soldes' => $soldeModel->where('employe_id', $userId)->findAll()